[
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Spotify is one of the world's leading audio streaming platforms, offering access to millions of songs, albums, and podcasts from artists around the globe. It allows users to discover new music through smart AI-based recommendations and curated playlists that match their listening habits. You can follow your favorite artists, create custom playlists, and explore genres from pop and rock to indie and jazz. Spotify Premium enables offline listening, ad-free playback, and high-quality audio. Its seamless cross-device experience ensures you can start a song on your phone and continue it on your laptop or smart speaker. Spotify also supports collaborative playlists, letting friends share their music in real-time. Whether you’re working out, studying, or relaxing, Spotify curates the perfect soundtrack for every moment.",
    "size": 78,
    "reviews": 32100000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 23100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram is a global social media app designed for sharing photos, videos, and stories in a visually engaging way. With powerful creative tools, filters, and editing options, users can capture their favorite moments and express their personalities. Reels bring short-form video entertainment that connects millions through trends and music. Instagram Direct lets you message friends, share posts privately, and video chat with ease. The Explore page curates personalized content based on your interests, helping you discover creators, artists, and businesses. Businesses and influencers use Instagram to connect with their audiences and grow communities. From personal storytelling to brand promotion, Instagram’s versatility makes it a cornerstone of digital culture. It’s where creativity meets connection — a place to be inspired, entertained, and expressive every day.",
    "size": 150,
    "reviews": 145000000,
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 95000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 3,
    "description": "TikTok is a short-form video platform that celebrates creativity, humor, and community. Users can create, edit, and share 15-second to 10-minute videos using music, effects, and filters. It’s a space where trends start and global conversations unfold through challenges, memes, and reactions. TikTok’s powerful algorithm learns your preferences, tailoring your For You Page with content you’ll love. Whether it’s dance, cooking, gaming, or education, there’s something for everyone. The platform empowers creators to go viral and build careers by sharing authentic content. TikTok fosters inclusivity and encourages people to express themselves freely. Its intuitive editing tools make video production accessible to anyone. Beyond entertainment, TikTok has become a cultural hub that influences fashion, music, and lifestyle worldwide.",
    "size": 180,
    "reviews": 120000000,
    "ratingAvg": 4.4,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 80000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube is the world's largest video-sharing platform, where billions come to watch, learn, and entertain themselves. It hosts a massive collection of music videos, educational tutorials, vlogs, and live broadcasts. Users can subscribe to channels, leave comments, and create their own content easily. YouTube Shorts offers a quick way to engage with short-form videos, while YouTube Premium provides an ad-free experience with offline viewing and background play. Whether you’re learning a new skill, catching up on news, or following your favorite creators, YouTube brings global communities together. With powerful search, recommendation algorithms, and integration with Google services, YouTube continues to redefine online entertainment. It’s not just a platform — it’s an ecosystem of endless creativity and connection.",
    "size": 140,
    "reviews": 162000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 114000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 5,
    "description": "WhatsApp Messenger offers private, fast, and reliable communication for billions of people worldwide. With end-to-end encryption, your messages, voice calls, and video chats remain secure and accessible only to you and your contacts. You can share photos, videos, and documents instantly or create group chats to stay in touch with family and friends. WhatsApp Web and Desktop allow seamless syncing across devices. The app also supports voice notes, status updates, and disappearing messages for added privacy. Businesses use WhatsApp to connect with customers and provide real-time support. Its lightweight design ensures smooth performance even on low-data networks. Constant updates improve security and add features like Communities and large group video calls. WhatsApp continues to set the global standard for simple, trusted communication.",
    "size": 120,
    "reviews": 185000000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 143000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Snapchat is a multimedia messaging app that lets you share moments instantly through photos and short videos called Snaps. Its unique feature of disappearing messages encourages authentic and in-the-moment communication. With filters, lenses, and augmented reality effects, users can express themselves creatively. Stories allow friends to stay connected through daily updates, while Spotlight showcases trending public content. The Snap Map helps you discover friends and events nearby. Snapchat also supports Bitmoji avatars and chat features, blending fun with privacy. With a focus on real connections rather than permanent posts, Snapchat remains a favorite for younger audiences who value spontaneity. It’s a platform where everyday moments turn into playful, creative interactions that bring people closer together.",
    "size": 90,
    "reviews": 29000000,
    "ratingAvg": 4.2,
    "downloads": 2000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "Netflix is a global entertainment platform offering thousands of movies, series, and documentaries across all genres. With a subscription, users can stream unlimited content on multiple devices without ads. It features acclaimed originals like Stranger Things, The Crown, and Money Heist alongside licensed blockbusters. The personalized recommendation engine ensures every user finds something they love. You can download titles for offline viewing and enjoy adaptive streaming quality based on your connection. Netflix also offers subtitles, dubbing, and multi-language support to cater to global audiences. Its user-friendly interface makes browsing effortless, and parental controls ensure a family-safe experience. Constantly evolving with new releases every week, Netflix remains the go-to destination for quality entertainment at home or on the go.",
    "size": 145,
    "reviews": 13000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 6700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Telegram is a fast, secure, and privacy-focused messaging platform used by hundreds of millions worldwide. It supports cloud-based chats, file sharing, and channels with unlimited subscribers. Users can send large media files, host group chats with thousands of members, and enjoy self-destructing messages for added security. Telegram’s powerful bots, customization options, and cross-platform sync make it stand out among competitors. Secret chats use end-to-end encryption for private conversations. Telegram also doubles as a hub for communities, news channels, and entertainment groups. It is lightweight yet packed with features like folders, scheduled messages, and instant media downloads. Whether for personal chats or business broadcasts, Telegram delivers unmatched speed, flexibility, and reliability.",
    "size": 80,
    "reviews": 21000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 13400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 9,
    "description": "Discord is a communication platform designed for communities, gamers, and teams to connect through voice, video, and chat. Users can create or join servers with multiple text and voice channels. It supports media sharing, screen streaming, and integration with popular apps like Spotify and Twitch. Discord’s Nitro subscription offers enhanced emoji, higher upload limits, and HD streaming. It’s widely used for gaming, study groups, remote work, and fan communities. Advanced moderation tools help manage large groups efficiently. With customizable bots and roles, Discord enables both fun and professional interactions. The app continues to evolve into a social hub where people build connections, share passions, and collaborate across the world effortlessly.",
    "size": 120,
    "reviews": 14000000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 7500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 10,
    "description": "Pinterest is a visual discovery and bookmarking app where users can find inspiration for everything from recipes and fashion to home decor and travel ideas. You can save your favorite images, organize them into boards, and explore millions of creative posts curated by people worldwide. The platform’s algorithm learns your interests to suggest personalized ideas. Pinterest is widely used by designers, planners, and DIY enthusiasts for creative planning. It supports shoppable pins, helping users discover and buy products directly from the app. Whether you’re redesigning your home or planning a wedding, Pinterest acts as your personal idea library. With constant updates and a growing global community, it continues to inspire imagination and creativity every day.",
    "size": 110,
    "reviews": 13000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 7500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Gmail is one of the most widely used email services in the world, offering a fast, intuitive, and secure communication platform. It provides powerful spam filtering, smart categorization, and priority inbox features to help you manage your mail efficiently. With Google’s advanced AI, Gmail automatically suggests replies, detects phishing attempts, and keeps your inbox organized. Integration with Google Workspace allows seamless use with Drive, Calendar, and Meet. Users can schedule emails, use labels, and access messages offline. The app’s clean interface ensures a clutter-free experience across all devices. Gmail also encrypts your data for enhanced security. With ample storage and frequent updates, Gmail remains the go-to choice for personal, academic, and professional email communication globally.",
    "size": 90,
    "reviews": 14000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 7700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 12,
    "description": "Facebook connects billions of people worldwide through social networking. It allows users to share updates, photos, videos, and experiences with friends and family. The app provides personalized news feeds, community groups, live streaming, and an integrated marketplace for buying and selling products. Businesses use Facebook Pages and Ads to reach customers globally. The app’s event and group features foster real-world connections and discussions. It integrates seamlessly with Messenger, Instagram, and WhatsApp for a unified Meta experience. Facebook’s continuous innovations, like Reels and short videos, keep the platform engaging. With privacy settings, two-factor authentication, and post visibility controls, users can customize their experience. Whether for socializing, business, or inspiration, Facebook remains a digital meeting ground for everyone.",
    "size": 200,
    "reviews": 122000000,
    "ratingAvg": 4.2,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 72000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 13,
    "description": "X, formerly known as Twitter, is a social media platform where people share real-time updates, news, and opinions in short posts called tweets. It’s a hub for global conversations, breaking news, and viral trends. Users can follow personalities, brands, and friends to stay informed and engaged. The app supports media uploads, polls, Spaces for live audio discussions, and Communities for topic-focused groups. With the introduction of X Premium, users can enjoy enhanced features like longer posts, verified badges, and fewer ads. Businesses, journalists, and influencers rely on X to reach audiences instantly. It’s also a space for public discourse, activism, and humor, shaping online culture worldwide. X remains a dynamic network where every voice can be heard.",
    "size": 130,
    "reviews": 16000000,
    "ratingAvg": 4.1,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 14,
    "description": "Zoom is a world-leading platform for online meetings, webinars, and video conferencing. It provides crystal-clear video and audio quality, making virtual collaboration seamless across teams and organizations. Users can host one-on-one sessions or large conferences with thousands of participants. Zoom’s features include screen sharing, breakout rooms, cloud recording, and real-time chat. It’s widely used for education, remote work, and virtual events. The app offers robust security features, including password protection and waiting rooms for meeting control. Zoom integrates with calendars, Slack, and email platforms for scheduling ease. With its cross-device compatibility, participants can join from mobile, desktop, or browser. Known for its reliability and user-friendly design, Zoom remains essential for modern digital communication.",
    "size": 95,
    "reviews": 12000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 5700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 15,
    "description": "Reddit is an online community platform where millions of users share content, news, and discussions across thousands of topic-based forums called subreddits. From technology and science to memes and personal stories, Reddit offers a space for everyone. Users can post, comment, and upvote content that interests them, creating a democratic flow of popular ideas. The app’s home feed is tailored through subscriptions and engagement. Reddit fosters open discussion and provides anonymity, making it a hub for genuine conversation. Communities often host AMAs (Ask Me Anything) sessions with celebrities and experts. With an easy-to-use interface, moderation tools, and endless topics, Reddit is where the internet’s most interesting discussions begin. It’s a blend of entertainment, learning, and community spirit.",
    "size": 100,
    "reviews": 8800000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 3700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 16,
    "description": "LinkedIn is the world’s largest professional networking platform, connecting millions of professionals, job seekers, and companies across every industry. It helps users build resumes, showcase skills, and apply for jobs with ease. Recruiters and employers use it to find talent and promote opportunities. The app allows sharing of professional updates, articles, and achievements, fostering career growth and learning. LinkedIn Learning offers thousands of courses taught by experts to enhance your skills. It’s also a space for thought leadership, where business trends and insights are shared daily. With messaging, endorsements, and company pages, LinkedIn promotes meaningful professional relationships. Whether you’re hiring, networking, or learning, LinkedIn is the go-to app for building your career in the digital era.",
    "size": 120,
    "reviews": 11000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 5600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Spotify for Artists",
    "companyName": "Spotify AB",
    "id": 17,
    "description": "Spotify for Artists gives musicians and creators powerful tools to manage their presence on the Spotify platform. Artists can view detailed analytics on listener demographics, top-performing tracks, and real-time streaming data. The app allows easy profile customization, including bio updates and featured playlists. It provides valuable insights that help musicians make informed marketing and touring decisions. Spotify for Artists also supports team collaboration, giving managers and labels controlled access to performance stats. With dedicated resources and tutorials, it empowers creators to grow their audience organically. Artists can pitch new releases for playlist consideration directly within the app. It bridges the gap between creators and fans, offering transparency, engagement, and creative control in one platform.",
    "size": 85,
    "reviews": 270000,
    "ratingAvg": 4.5,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 160000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 18,
    "description": "Google Maps is the world’s most widely used navigation and location service, helping billions find directions, explore new places, and navigate efficiently. It provides real-time GPS navigation, live traffic updates, and local business information. Users can discover restaurants, gas stations, and attractions nearby with detailed reviews and photos. The app supports offline maps, voice-guided routes, and public transport information. Businesses use Google Maps to reach local customers through listings and visibility. Integration with Street View allows immersive virtual exploration of streets and landmarks. It also offers biking and walking routes, plus indoor navigation for malls and airports. Whether you’re driving across cities or exploring hidden gems, Google Maps ensures you never lose your way.",
    "size": 160,
    "reviews": 150000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 104000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 19,
    "description": "Google Drive is a secure cloud storage solution that allows users to store, access, and share files from any device. It integrates seamlessly with Google Workspace apps like Docs, Sheets, and Slides. With real-time collaboration, multiple users can edit documents simultaneously. The app automatically syncs files across all devices, ensuring your data is always up to date. Drive supports powerful search, file versioning, and offline access for uninterrupted productivity. Its sharing permissions make teamwork safe and flexible. Businesses and students use Google Drive for reliable file organization and backups. It offers generous free storage with paid plans for extra capacity. Easy to use and highly reliable, Google Drive simplifies digital file management for everyone.",
    "size": 120,
    "reviews": 12500000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 6600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 20,
    "description": "Amazon Shopping offers a convenient way to browse and purchase millions of products from the world’s largest online marketplace. From electronics and fashion to groceries and home essentials, users can find virtually anything. Personalized recommendations and lightning deals enhance the shopping experience. The app supports secure one-click checkout, order tracking, and customer reviews for informed decisions. Amazon Prime members enjoy exclusive benefits like free delivery, Prime Video access, and discounts. The app also allows easy returns, customer support, and live order updates. With voice integration via Alexa and seamless global shipping options, Amazon Shopping makes online retail effortless. It’s designed for speed, trust, and convenience, empowering users to shop smarter every day.",
    "size": 180,
    "reviews": 18000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 9100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "id": 21,
    "description": "CapCut is a free all-in-one video editing app that offers powerful tools for creating professional-quality videos. With features like keyframe animation, chroma key, filters, effects, and templates, anyone can craft engaging short videos or cinematic content. The app supports high-resolution exports, auto-captioning, and AI-based background removal. Its simple interface makes it accessible to beginners, while advanced features cater to experienced editors. CapCut integrates seamlessly with TikTok, allowing users to share creations instantly. It also includes trending sound libraries and aesthetic presets. Whether you’re editing vlogs, social media clips, or creative projects, CapCut provides everything you need to enhance your storytelling. It’s the ultimate mobile video editor for creators worldwide.",
    "size": 220,
    "reviews": 14500000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 7600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Spotify Lite",
    "companyName": "Spotify AB",
    "id": 22,
    "description": "Spotify Lite is a lightweight version of the popular Spotify app, designed for users with limited storage or slower internet connections. It offers essential music streaming features like playlists, recommendations, and search in a simplified interface. The app consumes less data and storage while maintaining smooth playback quality. Spotify Lite allows users to control data usage, track storage, and manage downloads efficiently. Despite its compact design, it retains the personalized experience of the main Spotify app. Ideal for emerging markets, it ensures accessibility without sacrificing core functionality. With fast loading times and intuitive controls, Spotify Lite brings the joy of music to everyone, regardless of device capability or network speed.",
    "size": 15,
    "reviews": 2400000,
    "ratingAvg": 4.2,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 23,
    "description": "Duolingo makes learning a new language fun and accessible for everyone. It offers bite-sized lessons, interactive exercises, and gamified progress tracking. Users can learn over 30 languages, including Spanish, French, Japanese, and English. The app’s engaging design keeps learners motivated through rewards and streaks. With adaptive learning powered by AI, Duolingo personalizes lessons based on user performance. It also includes speaking, listening, and reading exercises to enhance fluency. Duolingo for Schools helps teachers track student progress, while the paid Plus version offers offline learning. Its mascot, Duo the owl, provides encouragement and humor throughout your learning journey. Duolingo’s innovative approach has made it the most popular language-learning app worldwide.",
    "size": 60,
    "reviews": 10000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 7300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDbTh4pF/facebook-logo-vector-eps-file-squared-coloured-easily-editable-have-white-background-high-resolution.webp",
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "id": 24,
    "description": "Canva is an intuitive graphic design app that empowers users to create stunning visuals without professional design experience. With thousands of templates for social media posts, presentations, and posters, Canva simplifies creativity. It features drag-and-drop editing, stock photos, fonts, and icons for quick design building. Teams can collaborate in real-time and share designs instantly. Canva Pro unlocks advanced features like brand kits, background remover, and premium assets. Whether designing resumes, logos, or marketing materials, Canva suits both beginners and professionals. The app syncs across devices, allowing users to design anywhere. It’s the go-to design platform for students, entrepreneurs, and marketers who value speed, quality, and creativity in one app.",
    "size": 90,
    "reviews": 12000000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 8700000 }
    ]
  }
]

